README.org
#+TITLE: 从零开始用 Emacs 管理笔记
#+DATE: <2021-07-28 三>

其他入门教程：
+ [[https://github.com/redguardtoo/mastering-emacs-in-one-year-guide][一年成为Emacs高手 (像神一样使用编辑器)]]。
+ [[https://github.com/w0mTea/An.Emacs.Tutorial.for.Vim.User][An Emacs Tutorial for Vim User]]

* 前言

不同于其他 Emacs 教程，本文着重于从零开始通过 Emacs 做笔记管理，这样做的好处如下：

+ 不着眼于替换你现在的编辑器或者 IDE 避免降低工作效率；
+ org-mode 是一种非常具有表达力的文档标记格式，并且配合 org-babel 可以执行代码块保存实验结果（类似 Jupyter Notebook）；
+ [[https://github.com/org-roam/org-roam][org-roam]] 基于 org-mode 实现来 Roam Research[fn:1][fn:2] 的方式进行先进的笔记管理；
+ 基于 GitHub 可以实现免费的托管和；
+ 配合 [[https://github.com/kaushalmodi/ox-hugo/][ox-hugo]] 生成 [[https://gohugo.io][hugo]] 站点并结合 GitHub Pages 免费发布到网上。

也许通过这个你可以爱上 Emacs 并开始将它作为主要编辑器最终助力你提升工作效率。
* 黑话
Emacs 诞生的时间比较早，有些概念也是很早就确定了，带着时代的气息，可能不是很好理解。所以为了便于大家理解，我们在此提前进行解释，大家遇到不懂的可以随时翻回来查看:
** 快捷键
| 黑话                        | 解释                                                                                                             |
|-----------------------------+------------------------------------------------------------------------------------------------------------------|
| ~C-c~                       | 按住 ~Ctrl~ 不松开然后按 ~c~                                                                                     |
| ~C-x C-c~[fn:4]             | 组合快捷键，你需要先按出 ~C-x~ ，然后继续按出 ~Ctrl-c~ ，两段快捷键中间可以间隔任意时间                     |
| ~C-g~                       | 假如你快捷键按到一半想要放弃，可以通过这个快捷键放弃。（当然不仅是放弃快捷键，很多操作都可以通过这个快捷键终止） |
| ~M-x~                       | ~Meta~ + ~c~ ，Meta 键一般意味着 Alt 或者 ESC                                                                    |
| ~s-l~                       | ~Super~ + ~l~ , Super 键现在比较少见，可以通过 ~C-x @-s~ 按出 ~s-~ 前缀，所以这个完整的快捷键是 ~C-x @-s l~      |
| ~M-x org-id-get-create RET~ | ~M-x~ 会弹出命令输出框，然后输入 ~org-id-get-create~ 按回车（ ~RET~ 表示回车）                                   |
** 概念
| 黑话   | 解释                                                                                         |
|--------+----------------------------------------------------------------------------------------------|
| frame  | 图形界面的窗口：通过 ~C-x 5 2~ 创建一个试试，然后 ~C-x 5 0~ 关闭                             |
| window | 分割面板：通过 ~C-x 2~ 水平分割， ~C-x 3~ 垂直分割， ~C-x o~ 切换面板， ~C-x 0~ 关闭当前面板 |
| face   | 文本显示方式，字体等                                                                         |
* 安装、启动、退出
现在最新稳定版是 27.2，主线版本是 Emacs 28 并且已经合并 Native Comp，我日常使用的就是编译了 Native Comp 的主线版本。
为了贴合我们的主题我们这里选择最新的稳定版本 27.2 进行，建议大家也安装最新稳定版 27.2。
** Linux
+ yum（CentOS/RHEL/Fedora）
  #+BEGIN_SRC
  #+END_SRC
+ apt（Debian/Ubuntu）
  #+BEGIN_SRC
  #+END_SRC
+ pacman（Archlinux）
** macOS
macOS 默认安装了 Emacs，但是版本比较低，建议大家从社区安装最新版。我之前比较常用的是 emacs-mac 这个版本，可以通过 [[https://brew.sh/][Homebrew]] 安装：
#+BEGIN_SRC shell
$ brew tap railwaycat/emacsmacport
$ brew install emacs-mac
#+END_SRC
然后在终端里通过以下命令打开 Emacs：
#+BEGIN_SRC
$ open -a /usr/local/opt/emacs-mac/Emacs.app/
#+END_SRC
** Windows
可以通过 Powershell 和 [[https://chocolatey.org/][Chocolatey]][fn:3] 安装：
#+BEGIN_SRC powershell
PS> choco install emacs-full
#+END_SRC
安装后可以在 Powershell 中启动 Emacs：
#+BEGIN_SRC powershell
PS> emacs
#+END_SRC
** 退出 Emacs
快捷键按 ~C-x C-c~ （就是按住 ~Ctrl~ 不松开继续按 ~x~ ，然后再按住 ~Ctrl~ 不松开继续按 ~c~ ，聪明的你肯定发现只要按住 ~Ctrl~ 不松开依次按 ~x~ 和 ~c~ 键就可以了）。
* 插件包管理
* 基本增强
默认安装的 Emacs 可以说是又丑又不好用，所以为了使用更加顺畅或者更贴合现代编辑器，我们需要修改一些配置并做一些插件的扩展。
** 外观
+ doom-theme
+ doom-modeline
+ all-the-icons
+ dashboard
** 操作
+ ivy
+ counsel
+ swiper
+ which-key
* 操作习惯的改变
** 是否需要左侧目录树？
** 是否需要 Tabbar？
** 习惯 ~M-x~ 和 ~C-h ?~
* 准备笔记记录
* 开始笔记记录
* 收集笔记：org-protocol
* 托管笔记：magit
* 导出 Hugo 站点
* 发布 GitHub Pages
** GitHub workflow
* Footnotes


[fn:4] 这是退出 Emacs 的快捷键，非常有用，相信我
[fn:3] [[https://zhuanlan.zhihu.com/p/111673670][在 Windows 上安装 GNU Emacs]]
[fn:2] [[https://fortelabs.co/blog/how-to-take-smart-notes/][How To Take Smart Notes: 10 Principles to Revolutionize Your Note-Taking and Writing]]
[fn:1] [[https://www.nateliason.com/blog/roam][https://www.nateliason.com/blog/roam]]
